// найти квадрат числа
// Console.WriteLine("Input number");
// int num = Convert.ToInt32(Console.ReadLine());
// int quad = num * num; 
// Console.Write($"Quad of {num} -> {quad} ");

//Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
// Console.WriteLine("Input number 1");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Input number 2");
// int num2 = Convert.ToInt32(Console.ReadLine());
// int quad = num2 * num2;
// if (quad == num1)
// {
//     Console.WriteLine($"{num1} is quad of {num2}");
// }
// else
// {
// Console.WriteLine($"{num1} is not quad of {num2}");
// }

// Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.
// Console.WriteLine("Input numberN");
// int numN = Convert.ToInt32(Console.ReadLine());

// if (numN > 0)
// {
//     int count = numN * -1;
//     while (count <= numN)
//     {
//         Console.Write(count + " ");
//         count++;
//     }
// }
// if (numN < 0)
// {
//     int count = numN;
//     while (count <= numN * -1)
//     {
//         Console.Write(count + " ");
//         count++;
//     }
// }

//Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает **последнюю** цифру этого числа.
/*Console.WriteLine("Input number N");
int numN = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(numN % 10);*/

/*Console.WriteLine("Input number N");
int numN = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(Math.Abs(numN)%10);*/





